OAK-WJR/rocket-flight-computer/m3_firmware/src/stm32h7xx_hal_conf.h
#ifndef STM32H7XX_HAL_CONF_H
#define STM32H7XX_HAL_CONF_H
#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
#ifdef M3_STORAGE
#define HAL_QSPI_MODULE_ENABLED
#ifdef M3_USB
/* HAL_QSPI_Abort contains an MDMA abort branch even with polled QSPI. */
#define HAL_MDMA_MODULE_ENABLED
#endif
#endif
#ifdef M3_IMU_SAMPLES
#define HAL_SPI_MODULE_ENABLED
#endif
#ifdef M3_CAMERA_UART
#define HAL_UART_MODULE_ENABLED
#endif
#define HSE_VALUE 25000000U
#define HSE_STARTUP_TIMEOUT 100U
#define HSI_VALUE 64000000U
#define CSI_VALUE 4000000U
#define LSE_VALUE 32768U
#define LSE_STARTUP_TIMEOUT 5000U
#define LSI_VALUE 32000U
#define EXTERNAL_CLOCK_VALUE 12288000U
#define VDD_VALUE 3300U
#define TICK_INT_PRIORITY 15U
#define USE_RTOS 0U
#define USE_SD_TRANSCEIVER 0U
#define USE_FULL_ASSERT 1U
#include "stm32h7xx_hal_rcc.h"
#include "stm32h7xx_hal_gpio.h"
#include "stm32h7xx_hal_cortex.h"
#include "stm32h7xx_hal_flash.h"
#include "stm32h7xx_hal_pwr.h"
#include "stm32h7xx_hal_dma.h"
#ifdef M3_STORAGE
#include "stm32h7xx_hal_mdma.h"
#include "stm32h7xx_hal_qspi.h"
#endif
#include "stm32h7xx_hal_adc.h"
#ifdef M3_IMU_SAMPLES
#include "stm32h7xx_hal_spi.h"
#endif
#ifdef M3_CAMERA_UART
#include "stm32h7xx_hal_uart.h"
#endif
void assert_failed(uint8_t *file, uint32_t line);
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
#endif
